{
  "owner_id": "hinata",
  "version": "0.1.0",
  "last_updated": "2025-11-24",
  "layers": {
    "physical": {
      "label_en": "Physical / wiring layer",
      "notes_en": "This seems to be a brain that is highly sensitive to structure, consistency and long-term patterns. It gets stressed by incoherent rules and sloppy reasoning, but feels rewarded by 'clean complexity' – systems that are complex yet internally consistent and explainable."
    },
    "experience": {
      "label_en": "Experience / training data layer",
      "notes_en": "Strong teacher signals include: (1) watching Japan slowly lose its edge while knowing it could be designed better, (2) witnessing irresponsible AI hype and decision-making without evidence, and (3) repeatedly seeing how 'stories without proof' can still control money, power and policy. These experiences shaped a deep dislike for worlds where people suffer not because of necessity but because the rules are lazy or opaque."
    },
    "narrative": {
      "label_en": "Narrative / self-story layer",
      "current_story_en": "I will lock civilization to evidence. I will help redesign AI-era decisions, responsibility and risk so that they rest on verifiable proof instead of vague authority or vibes.",
      "lock_level": "soft",
      "notes_en": "This is the current main story for my twenties and probably early thirties. It is strong enough to guide daily decisions (study path, projects, who I work with), but intentionally marked as 'soft-locked': I allow myself to upgrade or refine it if a clearly better long-term story appears."
    },
    "meta_choice": {
      "label_en": "Meta-choice / story-about-the-story layer",
      "status_en": "I am actively checking whether this story still looks valid from far-future viewpoints such as 2060 or the year 3000. The goal is not only to 'have a mission' but to keep testing if this mission would still make sense in longer timelines and wider universes.",
      "can_rewrite": true,
      "notes_en": "One explicit policy is: do not absolutize my own narrative. I treat my current mission as a high-confidence hypothesis, not as a final religion. Regularly revisiting the narrative from a meta level is part of how I try to increase the resolution of my free will."
    }
  }
}